redditclone/app/models/user.rb

    def self.find_by_credentials(name, password)
        user = User.find_by(name: name)
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "LAKE"], ["LIMIT", 1]]